# GetLevelsThatShowGrids Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View3D..::..GetLevelsThatShowGrids Method
View3D Class See Also
---
Returns the list of levels ids where grids are displayed in this 3D view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public ISet<ElementId> GetLevelsThatShowGrids()
```

Visual Basic
---
```text
Public Function GetLevelsThatShowGrids As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetLevelsThatShowGrids()
```

# ### Return Value
The list of levels ids where grids are displayed in 3D views.
# See Also
View3D Class
Autodesk.Revit.DB Namespace